#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.licences_app_service.module.licences_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.licences_app_service.module.licences_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.payments_app_service.module.payments.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APP_ENV"                                         = "production"
          + "AUTH_SECRET"                                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=AUTH-SECRET-PAYMENTS)"
          + "AUTH_TRUST_HOST"                                 = "true"
          + "AUTH_URL"                                        = "https://payments.ipatente.io.pagopa.it/"
          + "EXT_API_BASE_PATH"                               = "/api"
          + "EXT_API_BASE_URL"                                = "http://example.com"
          + "EXT_API_MOCKING"                                 = "true"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "INTEROP_AUTH_SERVER_ENDPOINT_URL"                = "https://auth.uat.interop.pagopa.it/token.oauth2"
          + "INTEROP_CLIENT_ASSERTION_AUD"                    = "auth.uat.interop.pagopa.it / client-assertion"
          + "INTEROP_CLIENT_ASSERTION_ISS"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-ISS-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_KID"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-KID-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_PK"                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PK-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PURPOSE-ID-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_SUB"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-SUB-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_TYPE"                   = "urn:ietf:params:oauth:client-assertion-type:jwt-bearer"
          + "INTEROP_CLIENT_ID"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ID-PAYMENTS)"
          + "INTEROP_GRANT_TYPE"                              = "client_credentials"
          + "NEXT_PUBLIC_BFF_API_BASE_PATH"                   = "/api"
          + "NEXT_PUBLIC_BFF_API_BASE_URL"                    = "https://payments.ipatente.io.pagopa.it"
          + "NEXT_PUBLIC_BFF_API_MOCKING"                     = "true"
          + "NEXT_PUBLIC_IS_MSW_ENABLED"                      = "true"
          + "NODE_ENV"                                        = "production"
          + "OIDC_CLIENT_ID"                                  = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-ID-PAYMENTS)"
          + "OIDC_CLIENT_REDIRECT_URI"                        = "https://payments.ipatente.io.pagopa.it/api/auth/callback/fims"
          + "OIDC_CLIENT_SECRET"                              = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-SECRET-PAYMENTS)"
          + "OIDC_ISSUER_URL"                                 = "https://payments.ipatente.io.pagopa.it/api/auth/mocks/oidc"
          + "OIDC_MOCK_FORCED_ENABLE"                         = "true"
          + "OIDC_MOCK_JWT_PRIVATE_KEY"                       = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PRIVATE-KEY)"
          + "OIDC_MOCK_JWT_PUBLIC_KEY"                        = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PUBLIC-KEY)"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-ipatente-payments-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-ipatente-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "APP_ENV",
            ]
        }
    }

  # module.payments_app_service.module.payments.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APP_ENV"                                         = "staging"
          + "AUTH_SECRET"                                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=AUTH-SECRET-PAYMENTS)"
          + "AUTH_TRUST_HOST"                                 = "true"
          + "AUTH_URL"                                        = "https://payments.ipatente.io.pagopa.it/"
          + "EXT_API_BASE_PATH"                               = "/api"
          + "EXT_API_BASE_URL"                                = "http://example.com"
          + "EXT_API_MOCKING"                                 = "true"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "INTEROP_AUTH_SERVER_ENDPOINT_URL"                = "https://auth.uat.interop.pagopa.it/token.oauth2"
          + "INTEROP_CLIENT_ASSERTION_AUD"                    = "auth.uat.interop.pagopa.it / client-assertion"
          + "INTEROP_CLIENT_ASSERTION_ISS"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-ISS-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_KID"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-KID-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_PK"                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PK-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PURPOSE-ID-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_SUB"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-SUB-PAYMENTS)"
          + "INTEROP_CLIENT_ASSERTION_TYPE"                   = "urn:ietf:params:oauth:client-assertion-type:jwt-bearer"
          + "INTEROP_CLIENT_ID"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ID-PAYMENTS)"
          + "INTEROP_GRANT_TYPE"                              = "client_credentials"
          + "NEXT_PUBLIC_BFF_API_BASE_PATH"                   = "/api"
          + "NEXT_PUBLIC_BFF_API_BASE_URL"                    = "https://payments.ipatente.io.pagopa.it"
          + "NEXT_PUBLIC_BFF_API_MOCKING"                     = "true"
          + "NEXT_PUBLIC_IS_MSW_ENABLED"                      = "true"
          + "NODE_ENV"                                        = "production"
          + "OIDC_CLIENT_ID"                                  = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-ID-PAYMENTS)"
          + "OIDC_CLIENT_REDIRECT_URI"                        = "https://payments.ipatente.io.pagopa.it/api/auth/callback/fims"
          + "OIDC_CLIENT_SECRET"                              = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-SECRET-PAYMENTS)"
          + "OIDC_ISSUER_URL"                                 = "https://payments.ipatente.io.pagopa.it/api/auth/mocks/oidc"
          + "OIDC_MOCK_FORCED_ENABLE"                         = "true"
          + "OIDC_MOCK_JWT_PRIVATE_KEY"                       = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PRIVATE-KEY)"
          + "OIDC_MOCK_JWT_PUBLIC_KEY"                        = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PUBLIC-KEY)"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.payments_app_service.module.payments.azurerm_private_endpoint.app_service_sites will be created
  + resource "azurerm_private_endpoint" "app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-ipatente-payments-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-ipatente-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-ipatente-payments-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.payments_app_service.module.payments.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-ipatente-payments-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-ipatente-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-ipatente-payments-staging-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.payments_app_service.module.payments.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-itn-ipatente-payments-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-itn-ipatente-rg-01"
      + sku_name                     = "P0v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.payments_app_service.module.payments.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.25.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-ipatente-payments-app-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.practices_app_service.module.practices.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APP_ENV"                                         = "production"
          + "AUTH_SECRET"                                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=AUTH-SECRET-PRACTICES)"
          + "AUTH_TRUST_HOST"                                 = "true"
          + "AUTH_URL"                                        = "https://practices.ipatente.io.pagopa.it/"
          + "EXT_API_BASE_PATH"                               = "/api"
          + "EXT_API_BASE_URL"                                = "http://example.com"
          + "EXT_API_MOCKING"                                 = "true"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "INTEROP_AUTH_SERVER_ENDPOINT_URL"                = "https://auth.uat.interop.pagopa.it/token.oauth2"
          + "INTEROP_CLIENT_ASSERTION_AUD"                    = "auth.uat.interop.pagopa.it / client-assertion"
          + "INTEROP_CLIENT_ASSERTION_ISS"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-ISS-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_KID"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-KID-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_PK"                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PK-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PURPOSE-ID-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_SUB"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-SUB-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_TYPE"                   = "urn:ietf:params:oauth:client-assertion-type:jwt-bearer"
          + "INTEROP_CLIENT_ID"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ID-PRACTICES)"
          + "INTEROP_GRANT_TYPE"                              = "client_credentials"
          + "NEXT_PUBLIC_BFF_API_BASE_PATH"                   = "/api"
          + "NEXT_PUBLIC_BFF_API_BASE_URL"                    = "https://practices.ipatente.io.pagopa.it"
          + "NEXT_PUBLIC_BFF_API_MOCKING"                     = "true"
          + "NEXT_PUBLIC_IS_MSW_ENABLED"                      = "true"
          + "NODE_ENV"                                        = "production"
          + "OIDC_CLIENT_ID"                                  = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-ID-PRACTICES)"
          + "OIDC_CLIENT_REDIRECT_URI"                        = "https://practices.ipatente.io.pagopa.it/api/auth/callback/fims"
          + "OIDC_CLIENT_SECRET"                              = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-SECRET-PRACTICES)"
          + "OIDC_ISSUER_URL"                                 = "https://practices.ipatente.io.pagopa.it/api/auth/mocks/oidc"
          + "OIDC_MOCK_FORCED_ENABLE"                         = "true"
          + "OIDC_MOCK_JWT_PRIVATE_KEY"                       = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PRIVATE-KEY)"
          + "OIDC_MOCK_JWT_PUBLIC_KEY"                        = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PUBLIC-KEY)"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-ipatente-practices-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-ipatente-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "APP_ENV",
            ]
        }
    }

  # module.practices_app_service.module.practices.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "AI_SDK_CONNECTION_STRING"                        = (sensitive value)
          + "APP_ENV"                                         = "staging"
          + "AUTH_SECRET"                                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=AUTH-SECRET-PRACTICES)"
          + "AUTH_TRUST_HOST"                                 = "true"
          + "AUTH_URL"                                        = "https://practices.ipatente.io.pagopa.it/"
          + "EXT_API_BASE_PATH"                               = "/api"
          + "EXT_API_BASE_URL"                                = "http://example.com"
          + "EXT_API_MOCKING"                                 = "true"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "INTEROP_AUTH_SERVER_ENDPOINT_URL"                = "https://auth.uat.interop.pagopa.it/token.oauth2"
          + "INTEROP_CLIENT_ASSERTION_AUD"                    = "auth.uat.interop.pagopa.it / client-assertion"
          + "INTEROP_CLIENT_ASSERTION_ISS"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-ISS-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_KID"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-KID-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_PK"                     = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PK-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_PURPOSE_ID"             = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-PURPOSE-ID-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_SUB"                    = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ASSERTION-SUB-PRACTICES)"
          + "INTEROP_CLIENT_ASSERTION_TYPE"                   = "urn:ietf:params:oauth:client-assertion-type:jwt-bearer"
          + "INTEROP_CLIENT_ID"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=INTEROP-CLIENT-ID-PRACTICES)"
          + "INTEROP_GRANT_TYPE"                              = "client_credentials"
          + "NEXT_PUBLIC_BFF_API_BASE_PATH"                   = "/api"
          + "NEXT_PUBLIC_BFF_API_BASE_URL"                    = "https://practices.ipatente.io.pagopa.it"
          + "NEXT_PUBLIC_BFF_API_MOCKING"                     = "true"
          + "NEXT_PUBLIC_IS_MSW_ENABLED"                      = "true"
          + "NODE_ENV"                                        = "production"
          + "OIDC_CLIENT_ID"                                  = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-ID-PRACTICES)"
          + "OIDC_CLIENT_REDIRECT_URI"                        = "https://practices.ipatente.io.pagopa.it/api/auth/callback/fims"
          + "OIDC_CLIENT_SECRET"                              = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-CLIENT-SECRET-PRACTICES)"
          + "OIDC_ISSUER_URL"                                 = "https://practices.ipatente.io.pagopa.it/api/auth/mocks/oidc"
          + "OIDC_MOCK_FORCED_ENABLE"                         = "true"
          + "OIDC_MOCK_JWT_PRIVATE_KEY"                       = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PRIVATE-KEY)"
          + "OIDC_MOCK_JWT_PUBLIC_KEY"                        = "@Microsoft.KeyVault(VaultName=io-p-itn-ipatente-kv-01;SecretName=OIDC-JWT-PUBLIC-KEY)"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.practices_app_service.module.practices.azurerm_private_endpoint.app_service_sites will be created
  + resource "azurerm_private_endpoint" "app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-ipatente-practices-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-ipatente-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-ipatente-practices-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.practices_app_service.module.practices.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-ipatente-practices-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-ipatente-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-ipatente-practices-staging-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.practices_app_service.module.practices.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-itn-ipatente-practices-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-itn-ipatente-rg-01"
      + sku_name                     = "P0v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.practices_app_service.module.practices.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.26.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-ipatente-practices-app-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
